CSI API ETABS v1

# cGenDisplCountPoint Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int CountPoint(
    	string Name,
    	ref int Count
    )

    Function CountPoint (
    	Name As String,
    	ByRef Count As Integer
    ) As Integer

    Dim instance As cGenDispl
    Dim Name As String
    Dim Count As Integer
    Dim returnValue As Integer

    returnValue = instance.CountPoint(Name,
    	Count)

    int CountPoint(
    	String^ Name,
    	int% Count
    )

    abstract CountPoint :
            Name : string *
            Count : int byref -> int

#### Parameters

Name

    Type: SystemString

Count

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cGenDispl Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com